#### Introductory Python

In [7]:
import openpyxl
import pandas as pd

In [4]:
from openpyxl import Workbook

In [5]:
df1_csv=pd.read_csv('Excel_Overwrite.csv')

In [15]:
df1_csv.to_excel('Excel_Overwrite.xlsx',index=False)

In [89]:
df1_excel=pd.read_excel('Excel_Overwrite.xlsx',engine='openpyxl')

In [90]:
df1_excel

     Months         Sales
0   2018-01  12435.000000
1   2018-02  11191.500000
2   2018-03  10072.350000
3   2018-04   9065.115000
4   2018-05   8158.603500
5   2018-06   7342.743150
6   2018-07   6608.468835
7   2018-08   5947.621952
8   2018-09   5352.859756
9   2018-10   4817.573781
10  2018-11   4335.816403
11  2018-12   3902.234762

In [19]:
df1_excel.iloc[1,1]

11191.5

In [20]:
df1_excel.loc[df1_excel.Months=='2018-01']

    Months    Sales
0  2018-01  12435.0

#### Lambda Apply Function

In [37]:
df1_excel['Tax%']=df1_excel['Sales'].apply(lambda x: 0.3 if x>=10000 else 0.2 if 5000<x<10000 else 0.1)

In [38]:
df1_excel['Tax Owed']=df1_excel['Tax%']*df1_excel['Sales']

In [32]:
df1_excel

     Months         Sales     Tax Owed
0   2018-01  12435.000000  3730.500000
1   2018-02  11191.500000  3357.450000
2   2018-03  10072.350000  3021.705000
3   2018-04   9065.115000  1813.023000
4   2018-05   8158.603500  1631.720700
5   2018-06   7342.743150  1468.548630
6   2018-07   6608.468835  1321.693767
7   2018-08   5947.621952  1189.524390
8   2018-09   5352.859756  1070.571951
9   2018-10   4817.573781   481.757378
10  2018-11   4335.816403   433.581640
11  2018-12   3902.234762   390.223476

#### Dropping columns in DF

In [30]:
to_drop=['Tax%']

In [31]:
df1_excel.drop(columns=to_drop,inplace=True)

#### Replacing a Column Value with condition on another column

In [39]:
df1_excel['Test']=False

In [51]:
df1_excel.loc[df1_excel.Sales<5000,'Test']=True

In [80]:
df1_excel

     Months         Sales  Tax%     Tax Owed   Test
0   2018-01  12435.000000   0.3  3730.500000  False
1   2018-02  11191.500000   0.3  3357.450000  False
2   2018-03  10072.350000   0.3  3021.705000  False
3   2018-04   9065.115000   0.2  1813.023000  False
4   2018-05   8158.603500   0.2  1631.720700  False
5   2018-06   7342.743150   0.2  1468.548630  False
6   2018-07   6608.468835   0.2  1321.693767  False
7   2018-08   5947.621952   0.2  1189.524390  False
8   2018-09   5352.859756   0.2  1070.571951  False
9   2018-10   4817.573781   0.1   481.757378   True
10  2018-11   4335.816403   0.1   433.581640   True
11  2018-12   3902.234762   0.1   390.223476   True

#### Group BY

In [53]:
df1_excel.groupby(['Test']).mean()

             Sales      Tax%     Tax Owed
Test
False  8463.806910  0.233333  2067.193049
True   4351.874982  0.100000   435.187498

#### Sort Function

In [54]:
df1_excel.groupby(['Test']).mean().sort_values(['Sales'])

             Sales      Tax%     Tax Owed
Test
True   4351.874982  0.100000   435.187498
False  8463.806910  0.233333  2067.193049

In [56]:
df1_excel.groupby(['Test']).mean().sort_values(['Sales'],ascending=False)

             Sales      Tax%     Tax Owed
Test
False  8463.806910  0.233333  2067.193049
True   4351.874982  0.100000   435.187498

#### Openpyxl

In [ ]:
####Creating New Workbook

In [103]:
import openpyxl

In [107]:
from openpyxl import Workbook
from openpyxl import load_workbook
from openpyxl.styles import Font

In [59]:
wb=Workbook() #Worbok Object

In [62]:
ws=wb.active #Workssheet Object

In [64]:
ws1=wb.create_sheet('NewSheet')

In [65]:
ws2=wb.create_sheet('Another',0)

In [66]:
ws.title='MySheet'

In [67]:
wb.sheetnames

['Another', 'MySheet', 'NewSheet']

In [ ]:
#### Loading Existing Workbook

In [68]:
wb2=load_workbook('Excel_Overwrite.xlsx')

In [69]:
new_sheet=wb2.create_sheet('NewSheet')

In [73]:
wb2.sheetnames

['Sheet1', 'NewSheet']

In [70]:
active_sheet=wb2.active

In [75]:
cell=active_sheet['A1']

In [77]:
cell.value

'Months'

In [78]:
active_sheet['A1']='Month'

In [79]:
active_sheet['A1'].value

'Month'

In [81]:
cell_c=ws['A':'E']

In [84]:
cell_r=ws[1:12]

In [93]:
for row in ws.iter_rows(min_row=1,max_row=12,max_col=2):
    for cell in row:
        print(cell)

<Cell 'MySheet'.A1>
<Cell 'MySheet'.B1>
<Cell 'MySheet'.A2>
<Cell 'MySheet'.B2>
<Cell 'MySheet'.A3>
<Cell 'MySheet'.B3>
<Cell 'MySheet'.A4>
<Cell 'MySheet'.B4>
<Cell 'MySheet'.A5>
<Cell 'MySheet'.B5>
<Cell 'MySheet'.A6>
<Cell 'MySheet'.B6>
<Cell 'MySheet'.A7>
<Cell 'MySheet'.B7>
<Cell 'MySheet'.A8>
<Cell 'MySheet'.B8>
<Cell 'MySheet'.A9>
<Cell 'MySheet'.B9>
<Cell 'MySheet'.A10>
<Cell 'MySheet'.B10>
<Cell 'MySheet'.A11>
<Cell 'MySheet'.B11>
<Cell 'MySheet'.A12>
<Cell 'MySheet'.B12>

#### Working with Multiple Sheets

In [94]:
df_1=pd.read_excel('shifts.xlsx',sheet_name='Sheet',engine='openpyxl')
df_2=pd.read_excel('shifts.xlsx',sheet_name='Sheet1',engine='openpyxl')
df_3=pd.read_excel('shift_3.xlsx',engine='openpyxl')

In [97]:
df_all=pd.concat([df_1,df_2,df_3],sort=False,ignore_index=True)

In [98]:
df_all.to_excel('all_shifts.xlsx',index=None)

In [99]:
wb=load_workbook('all_shifts.xlsx')

In [100]:
ws=wb.active

In [101]:
total_col=ws['G1']

In [108]:
total_col.font=Font(bold=True)

In [109]:
total_col.value='Total'

In [111]:
e_col,f_col=['E','F']

In [113]:
for row in range(2,300):
    result_cell='G{}'.format(row)
    e_value=ws[e_col+str(row)].value
    f_value=ws[f_col+str(row)].value
    ws[result_cell]=e_value*f_value

In [114]:
wb.save('Totaled.xlsx')

In [118]:
df_m=pd.read_excel('Totaled.xlsx',engine='openpyxl')

In [119]:
df_m.head()

   Shift Region Sales Rep  Product  Cost per  Units Sold  Total
0      1  South    Meggan    Paper        15         163   2445
1      1  South    Charis  Stapler        25         108   2700
2      1  South    Shayne   Pencil         5         118    590
3      1  North   Krystin      Pen        10          37    370
4      1  South       Leo    Paper        15         131   1965

In [ ]:
from openpyxl.utils.dataframe import dataframe_to_rows
from openpyxl import load_workbook

In [5]:
rows=dataframe_to_rows(df1,index=False)

In [6]:
dest_wbk=load_workbook('Excel_Refreshed.xlsx')

In [7]:
dest_sheet=dest_wbk['Raw']

In [8]:
dest_sheet.max_row

1

In [9]:
for i in range(1,dest_sheet.max_row+1):
    for j in range(1,dest_sheet.max_column+1):
        dest_sheet.cell(row=i,column=j).value=None
dest_wbk.save('Excel_Refreshed.xlsx')

In [10]:
for r_idx,row in enumerate(rows,1):
    for c_idx,value in enumerate(rows,1):
        dest_sheet.cell(row=r_idx,column=c_idx,value=value)

ValueError: Cannot convert ['2018-01', 12435.0] to Excel